{
  "Color": "#ff5733",
  "Head": {
    "title": "Vineet Singh | Android Developer & ML Enthusiast",
    "NavbarName": "Vineet Singh"
  },
  "HomePage": {
    "name": "Vineet Singh",
    "Position": [
      "Android Developer",
      "Machine Learning Enthusiast",
      "Innovative App Creator",
      "Open Source Contributor"
    ],
    "description": "I design and build innovative Android applications with a focus on user experience and performance."
  },
  "AboutPage": {
    "AboutParagraph": "I am an Android developer and machine learning enthusiast with a passion for creating innovative and user-friendly applications. I have a strong background in both native and cross-platform mobile development, and I enjoy using my skills to create powerful and scalable apps. In my previous work, I have designed and developed applications for a variety of clients, including small businesses and large corporations. My goal is always to create applications that are visually appealing and perform seamlessly, leveraging the latest technologies and best practices.",
    "ImageLink": "https://cdn.vectorstock.com/i/1000x1000/23/81/default-avatar-profile-icon-vector-18942381.webp"
  },
  "Skills": [
    "Kotlin",
    "Python",
    "Dart",
    "SQL",
    "Machine Learning",
    "Neural Networks",
    "SciKit Learn",
    "Keras",
    "Android Studio",
    "Flutter",
    "Django",
    "MYSQL",
    "SQLite",
    "POSTMAN",
    "FIGMA",
    "REST APIs",
    "Retrofit",
    "Room Db"
  ],
  "Projects": [
    {
      "title": "OCR App",
      "ImageLink": "",
      "Status": "Completed",
      "ProjectName": "OCR App",
      "Technologies": [
        "Kotlin",
        "AWS Textract",
        "OpenAI API",
        "Firebase Authentication"
      ],
      "Description": "Developed a Native mobile OCR app using Kotlin for text extraction from images and integrated AWS Textract for real-time image text extraction. Enabled seamless AI-powered conversation using Coroutines via OpenAI API and personalized chat responses based on user interaction history. Ensured secure user access with Firebase authentication enhancing user experience and data privacy.",
      "DemoLink": "https://github.com/vineetsingh13/OCR"
    },
    {
      "title": "DocScan Sentry",
      "ImageLink": "",
      "Status": "Completed",
      "ProjectName": "DocScan Sentry",
      "Technologies": [
        "Google ML Kit",
        "RoomDb"
      ],
      "Description": "Scans and creates documents using the Google ML Kit library. Stores documents in RoomDB and offers functionalities to share, download, and search for documents enhancing user productivity.",
      "DemoLink": "https://play.google.com/store/apps/details?id=com.vineet.docscanner"
    },
    {
      "title": "Runner App",
      "ImageLink": "",
      "Status": "Completed",
      "ProjectName": "Runner App",
      "Technologies": [
        "Kotlin",
        "Google Maps SDK",
        "Dagger Hilt"
      ],
      "Description": "Developed an Android application using Kotlin and Android Studio for tracking running, cycling, and walking activities. Implemented Clean MVVM architecture leveraging Dagger Hilt for dependency injection and Coroutines for asynchronous operations. Integrated Google Maps SDK and created graphical features to offer users insightful data visualization of their latest runs.",
      "DemoLink": "https://github.com/vineetsingh13/Runner"
    },
    {
      "title": "Tattooz",
      "ImageLink": "",
      "Status": "Completed",
      "ProjectName": "Tattooz",
      "Technologies": [
        "Kotlin"
      ],
      "Description": "Developed an Android application enabling unique tattoo design generation based on various inputs and styles. Integrated customization options allowing users to modify designs with different elements, sizes, and styles.",
      "DemoLink": "https://github.com/vineetsingh13/tattooz"
    }
  ],
  "Contact": {
    "Email": "singhvineet13502@gmail.com",
    "Github": "https://github.com/vineetsingh13",
    "Twitter": "",
    "LinkedIn": "https://www.linkedin.com/in/vineet-singh-139533250"
  }
}

